cmsis-svd/cmsis-svd/data/HDSC/HC32F146KX.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>DMAC</name>
            <description>desc DMAC</description>
            <baseAddress>0x40060000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x30</size>
            </addressBlock>
            <registers>
                <register>
                    <name>DMACR</name>
                    <description>desc DMACR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xDF000000</resetMask>
                    <fields>
                        <field>
                            <name>DH</name>
                            <description>desc DH</description>
                            <msb>27</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PR</name>
                            <description>desc PR</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DS</name>
                            <description>desc DS</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DE</name>
                            <description>desc DE</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMACA0</name>
                    <description>desc DMACA0</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF8FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TC</name>
                            <description>desc TC</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BC</name>
                            <description>desc BC</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IS</name>
                            <description>desc IS</description>
                            <msb>28</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ST</name>
                            <description>desc ST</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB</name>
                            <description>desc PB</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EB</name>
                            <description>desc EB</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMACB0</name>
                    <description>desc DMACB0</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FFF0001</resetMask>
                    <fields>
                        <field>
                            <name>EM</name>
                            <description>desc EM</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SS</name>
                            <description>desc SS</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CI</name>
                            <description>desc CI</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EI</name>
                            <description>desc EI</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RD</name>
                            <description>desc RD</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RS</name>
                            <description>desc RS</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RC</name>
                            <description>desc RC</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FD</name>
                            <description>desc FD</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FS</name>
                            <description>desc FS</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TW</name>
                            <description>desc TW</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MS</name>
                            <description>desc MS</description>
                            <msb>29</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMACSA0</name>
                    <description>desc DMACSA0</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DMACSA</name>
                            <description>desc DMACSA</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMACDA0</name>
                    <description>desc DMACDA0</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DMACDA</name>
                            <description>desc DMACDA</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMACA1</name>
                    <description>desc DMACA1</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF8FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TC</name>
                            <description>desc TC</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BC</name>
                            <description>desc BC</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IS</name>
                            <description>desc IS</description>
                            <msb>28</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ST</name>
                            <description>desc ST</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB</name>
                            <description>desc PB</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EB</name>
                            <description>desc EB</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMACB1</name>
                    <description>desc DMACB1</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FFF0001</resetMask>
                    <fields>
                        <field>
                            <name>EM</name>
                            <description>desc EM</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SS</name>
                            <description>desc SS</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CI</name>
                            <description>desc CI</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EI</name>
                            <description>desc EI</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RD</name>
                            <description>desc RD</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RS</name>
                            <description>desc RS</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RC</name>
                            <description>desc RC</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FD</name>
                            <description>desc FD</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FS</name>
                            <description>desc FS</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TW</name>
                            <description>desc TW</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MS</name>
                            <description>desc MS</description>
                            <msb>29</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMACSA1</name>
                    <description>desc DMACSA1</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DMACSA</name>
                            <description>desc DMACSA</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMACDA1</name>
                    <description>desc DMACDA1</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DMACDA</name>
                            <description>desc DMACDA</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
