cmsis-svd/cmsis-svd/data/HDSC/HC32F146KX.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>HWWDT</name>
            <description>desc HWWDT</description>
            <baseAddress>0x40011000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x18</size>
            </addressBlock>
            <registers>
                <register>
                    <name>WDT_LD</name>
                    <description>desc WDT_LD</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>WDT_VL</name>
                    <description>desc WDT_VL</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>WDT_CTL</name>
                    <description>desc WDT_CTL</description>
                    <addressOffset>0x8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x3</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>IE</name>
                            <description>desc IE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSTEN</name>
                            <description>desc RSTEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WDT_CLR</name>
                    <description>desc WDT_CLR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>WDT_STA</name>
                    <description>desc WDT_STA</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>STA</name>
                            <description>desc STA</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WDT_LCK</name>
                    <description>desc WDT_LCK</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>IRQC</name>
            <description>desc IRQC</description>
            <baseAddress>0x40031000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x94</size>
            </addressBlock>
            <registers>
                <register>
                    <name>IRQ_DSEL</name>
                    <description>desc IRQ_DSEL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF3F00320</resetMask>
                    <fields>
                        <field>
                            <name>AD0IS</name>
                            <description>desc AD0IS</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CT0IS</name>
                            <description>desc CT0IS</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CT2IS</name>
                            <description>desc CT2IS</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSC4RXIS</name>
                            <description>desc MSC4RXIS</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSC4TXIS</name>
                            <description>desc MSC4TXIS</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSC5RXIS</name>
                            <description>desc MSC5RXIS</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSC5TXIS</name>
                            <description>desc MSC5TXIS</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSC6RXIS</name>
                            <description>desc MSC6RXIS</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSC6TXIS</name>
                            <description>desc MSC6TXIS</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>E0IS</name>
                            <description>desc E0IS</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>E1IS</name>
                            <description>desc E1IS</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>E2IS</name>
                            <description>desc E2IS</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>E3IS</name>
                            <description>desc E3IS</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ_ST02</name>
                    <description>desc IRQ_ST02</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>NMI</name>
                            <description>desc NMI</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HWWDG</name>
                            <description>desc HWWDG</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ00PEND</name>
                    <description>desc IRQ00PEND</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>AFDI</name>
                            <description>desc AFDI</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ01PEND</name>
                    <description>desc IRQ01PEND</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>SWWDG</name>
                            <description>desc SWWDG</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ02PEND</name>
                    <description>desc IRQ02PEND</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>LVD</name>
                            <description>desc LVD</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ03PEND</name>
                    <description>desc IRQ03PEND</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>MEMIF</name>
                            <description>desc MEMIF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WOU10</name>
                            <description>desc WOU10</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WOU32</name>
                            <description>desc WOU32</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WOU54</name>
                            <description>desc WOU54</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ04PEND</name>
                    <description>desc IRQ04PEND</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>EXTI0</name>
                            <description>desc EXTI0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXTI1</name>
                            <description>desc EXTI1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXTI2</name>
                            <description>desc EXTI2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXTI3</name>
                            <description>desc EXTI3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXTI4</name>
                            <description>desc EXTI4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXTI5</name>
                            <description>desc EXTI5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXTI6</name>
                            <description>desc EXTI6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXTI7</name>
                            <description>desc EXTI7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ05PEND</name>
                    <description>desc IRQ05PEND</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>EXTI8</name>
                            <description>desc EXTI8</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXTI9</name>
                            <description>desc EXTI9</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXTI10</name>
                            <description>desc EXTI10</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXTI11</name>
                            <description>desc EXTI11</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXTI12</name>
                            <description>desc EXTI12</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXTI13</name>
                            <description>desc EXTI13</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXTI14</name>
                            <description>desc EXTI14</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EXTI15</name>
                            <description>desc EXTI15</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ06PEND</name>
                    <description>desc IRQ06PEND</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>DT1</name>
                            <description>desc DT1</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ15PEND</name>
                    <description>desc IRQ15PEND</description>
                    <addressOffset>0x50</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>MSC4INT</name>
                            <description>desc MSC4INT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ16PEND</name>
                    <description>desc IRQ16PEND</description>
                    <addressOffset>0x54</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>MSC4INT</name>
                            <description>desc MSC4INT</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ17PEND</name>
                    <description>desc IRQ17PEND</description>
                    <addressOffset>0x58</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x5</resetMask>
                    <fields>
                        <field>
                            <name>MSC5NT</name>
                            <description>desc MSC5NT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
