cmsis-svd/cmsis-svd/data/HDSC/HC32F146KX.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>PARITY</name>
            <description>desc PARITY</description>
            <baseAddress>0x4003C000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x8</size>
            </addressBlock>
            <registers>
                <register>
                    <name>PARITY_CTL</name>
                    <description>desc PARITY_CTL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x13</resetMask>
                    <fields>
                        <field>
                            <name>PE</name>
                            <description>desc PE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIE</name>
                            <description>desc PIE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PERROR</name>
                            <description>desc PERROR</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PARITY_ADDR</name>
                    <description>desc PARITY_ADDR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>desc ADDR</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>PCG</name>
            <description>desc PCG</description>
            <baseAddress>0x4003C100</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x28</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CLKEN0</name>
                    <description>desc CLKEN0</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x11010070</resetValue>
                    <resetMask>0x11010070</resetMask>
                    <fields>
                        <field>
                            <name>MSC4CK</name>
                            <description>desc MSC4CK</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSC5CK</name>
                            <description>desc MSC5CK</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSC6CK</name>
                            <description>desc MSC6CK</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADCCK</name>
                            <description>desc ADCCK</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMACK</name>
                            <description>desc DMACK</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GIOCK</name>
                            <description>desc GIOCK</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSTCTL0</name>
                    <description>desc RSTCTL0</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1010070</resetMask>
                    <fields>
                        <field>
                            <name>MSC4RST</name>
                            <description>desc MSC4RST</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSC5RST</name>
                            <description>desc MSC5RST</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSC6RST</name>
                            <description>desc MSC6RST</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADCRST</name>
                            <description>desc ADCRST</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMARST</name>
                            <description>desc DMARST</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLKEN1</name>
                    <description>desc CLKEN1</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3111</resetValue>
                    <resetMask>0x3111</resetMask>
                    <fields>
                        <field>
                            <name>CTCK</name>
                            <description>desc CTCK</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VCCK</name>
                            <description>desc VCCK</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TM4CK</name>
                            <description>desc TM4CK</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPA0CK</name>
                            <description>desc OPA0CK</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPA1CK</name>
                            <description>desc OPA1CK</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSTCTL1</name>
                    <description>desc RSTCTL1</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3113</resetMask>
                    <fields>
                        <field>
                            <name>CTMRST</name>
                            <description>desc CTMRST</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VCRST</name>
                            <description>desc VCRST</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TM4RST</name>
                            <description>desc TM4RST</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPA0RST</name>
                            <description>desc OPA0RST</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPA1RST</name>
                            <description>desc OPA1RST</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLKEN2</name>
                    <description>desc CLKEN2</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x10000</resetValue>
                    <resetMask>0x10000</resetMask>
                    <fields>
                        <field>
                            <name>LCDCCK</name>
                            <description>desc LCDCCK</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSTCTL2</name>
                    <description>desc RSTCTL2</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x10000</resetMask>
                    <fields>
                        <field>
                            <name>LCDCRST</name>
                            <description>desc LCDCRST</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
